&НаСервере
Функция ПолучитьСписокАптек()
	ДопСвойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("УчитыватьВРасчетеЗП");
	
	запрос=новый запрос;
	запрос.УстановитьПараметр("Свойство",ДопСвойство);
    запрос.УстановитьПараметр("истина",истина);	
	запрос.Текст=   "ВЫБРАТЬ
                           |	ПодразделенияОрганизацийДополнительныеРеквизиты.Ссылка КАК Ссылка,
                           |	ПодразделенияОрганизацийДополнительныеРеквизиты.Свойство КАК Свойство,
                           |	ПодразделенияОрганизацийДополнительныеРеквизиты.Значение КАК Значение
                           |ИЗ
                           |	Справочник.ПодразделенияОрганизаций.ДополнительныеРеквизиты КАК ПодразделенияОрганизацийДополнительныеРеквизиты
                           |ГДЕ
                           |	ПодразделенияОрганизацийДополнительныеРеквизиты.Свойство = &Свойство
                           |	И ПодразделенияОрганизацийДополнительныеРеквизиты.Значение = &истина" ;
						   Результат=запрос.Выполнить().Выгрузить();
СписокПодр=Результат.ВыгрузитьКолонку("Ссылка");
Возврат СписокПодр;
	конецфункции
&НаСервере
Функция СформироватьРасчетНачислений()
	
	Если Не ЗначениеЗаполнено(Подразделение)тогда
		Подр=ПолучитьСписокАптек();
	иначе
		Подр=Подразделение;
	конецесли;
	Для каждого Эл из Подр цикл
		Док=Документы.Аптека_НачислениеЗарплаты.НайтиПоРеквизиту("Подразделение",Эл.Ссылка);
		конеццикла;
	
	конецфункции
&НаКлиенте
Процедура Сформировать(Команда)
	// Вставить содержимое обработчика.
	СформироватьРасчетНачислений();
КонецПроцедуры
