
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Подразделение = Параметры.Подразделение;
	ПериодРегистрации = Параметры.ПериодРегистрации;
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаОК(Команда)
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("СуммаПоУмолчанию", СуммаПоУмолчанию);
	СтруктураВозврата.Вставить("ДанныеВременногоХранилища", ПолучитьДанныеЗаполнения());	
	ОповеститьОВыборе(СтруктураВозврата);
		
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеЗаполнения()
	
	Результат = Документы.ЗГ_ВводУдержанийСотрудников.ПолучитьРезультатЗапросаФизическихЛицДляЗаполнения(Подразделение, ПериодРегистрации, Должность);
	
	Если Результат.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю("Нет данных для заполнения!");
	КонецЕсли;
	
	Возврат ПоместитьВоВременноеХранилище(Результат.Выгрузить(), Новый УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура КнопкаОтмены(Команда)
	Закрыть();
КонецПроцедуры
