
&НаКлиенте
Процедура Загрузить(Команда)
	Значение = Новый Структура();
	Значение.Вставить("Параметр1", СтолбецТабельныйНомер);
	Значение.Вставить("Параметр2", СтолбецСуммаУдержания);
	Значение.Вставить("Параметр3", НомерСтрокиНачала);
	Значение.Вставить("Параметр4", НомерСтрокиКонец);
	ЭтаФорма.Закрыть(Значение);	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СтолбецТабельныйНомер="A";
	СтолбецСуммаУдержания="B";
	НомерСтрокиНачала=1;
	НомерСтрокиКонец=2;
КонецПроцедуры
