&НаКлиенте
Процедура Загрузить(Команда)
	Значение = Новый Структура();
	Значение.Вставить("Подразделение", ИндексКолонкиПоИмени(Подразделение));
	Значение.Вставить("ПланПоВыручкеВсего", ИндексКолонкиПоИмени(ПланПоВыручкеВсего));
	Значение.Вставить("ПланПоВыручкеОптики", ИндексКолонкиПоИмени(ПланПоВыручкеОптики));
	Значение.Вставить("КабинетВрача", ИндексКолонкиПоИмени(КабинетВрача));
	Значение.Вставить("КТЗБезОптики", ИндексКолонкиПоИмени(КТЗБезОптики));
	Значение.Вставить("ЗМЗБезОптики", ИндексКолонкиПоИмени(ЗМЗБезОптики));
	Значение.Вставить("ЗМЗОптики", ИндексКолонкиПоИмени(ЗМЗОптики));
	Значение.Вставить("НомерСтрокиНачало", НомерСтрокиНачало);
	Значение.Вставить("НомерСтрокиКонец", НомерСтрокиКонец);
	ЭтаФорма.Закрыть(Значение);
КонецПроцедуры
 &НаКлиенте
Процедура ПриОткрытии(Отказ)
	Подразделение="A";
	ПланПоВыручкеВсего="D";
	ПланПоВыручкеОптики="E";
	КабинетВрача="F";
	КТЗБезОптики="G";
	ЗМЗБезОптики="H";
	ЗМЗОптики="I";
	НомерСтрокиНачало=2;
	НомерСтрокиКонец=3;
КонецПроцедуры 
Функция ИндексКолонкиПоИмени(ИмяКолонки)
	КолСимволовВАлфавите = 26;
	Смещение             = КодСимвола("A", 1);
	КодСим               = КодСимвола(ИмяКолонки, 1);
	ПозСим               = КодСим - Смещение;
	
	Если СтрДлина(ИмяКолонки)=1 Тогда
		Возврат ПозСим;
	КонецЕсли;	
	
	Уровень              = ПозСим + 1;
	КодСим               = КодСимвола(ИмяКолонки, 2);
	ПозСим               = КодСим - Смещение;
	
	Возврат ПозСим + Уровень*КолСимволовВАлфавите;
КонецФункции