Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
ФизическоеЛицо=ТекПользователь.ФизическоеЛицо;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.ФизическоеЛицо = &ФизическоеЛицо
		|	И НЕ Сотрудники.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	СотрудникиМассив=Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Таблица1=КадровыйУчет.КадровыеДанныеСотрудников(Истина,СотрудникиМассив,"ФизическоеЛицо,Сотрудник,Подразделение");
    МассивПодразделений=Таблица1.ВыгрузитьКолонку("Подразделение");

	НастройкиОтчета = КомпоновщикНастроек.Настройки;
		
	ПараметрПодразделение = НастройкиОтчета.ПараметрыДанных.Элементы.Найти("Подразделение");
	
	//МассивПодразделений.Добавить(Справочники.ПодразделенияОрганизаций.НайтиПоНаименованию("Аптека Здоровый Город №45"));
	Если ЗначениеЗаполнено(МассивПодразделений) Тогда
	ПараметрПодразделение.Значение= МассивПодразделений;
	ПараметрПодразделение.Использование=Истина;
	КонецЕсли;
	   
КонецПроцедуры