
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ПланыВыручкиПоАптекам
	Движения.ПланыВыручкиПоАптекам.Записывать = Истина;
	Для Каждого ТекСтрокаПоказатели Из Показатели Цикл
		Движение = Движения.ПланыВыручкиПоАптекам.Добавить();
		Движение.Период = Период;
		Движение.Подразделение = ТекСтрокаПоказатели.Подразделение;
		Движение.ПланПоВыручкеВсего = ТекСтрокаПоказатели.ПланПоВыручкеВсего;
		Движение.ПланПоВыручкеОптики = ТекСтрокаПоказатели.ПланПоВыручкеОптики;
		Движение.КабинетВрача = ТекСтрокаПоказатели.КабинетВрача;
		Движение.КТЗБезОптики = ТекСтрокаПоказатели.КТЗБезОптики;
		Движение.ЗМЗБезОптики = ТекСтрокаПоказатели.ЗМЗБезОптики;
		Движение.ЗМЗОптики = ТекСтрокаПоказатели.ЗМЗОптики;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
