
Процедура ОбработкаПроведения(Отказ, Режим)
		// регистр НачисленияЗППоАптекам
	Движения.НачисленияЗППоАптекам.Записывать = Истина;
	Для Каждого ТекСтрокаТЧРасчет Из ТЧРасчет Цикл
		Движение = Движения.НачисленияЗППоАптекам.Добавить();
		Движение.Период = ПериодВыплатыС;
		Движение.Подразделение = Подразделение;
		Движение.ФизическоеЛицо = ТекСтрокаТЧРасчет.ФизическоеЛицо;
		Движение.Должность = ТекСтрокаТЧРасчет.Должность;
		Движение.ОсновнаяАптека = ТекСтрокаТЧРасчет.ОсновнаяАптека;
		Движение.ТН = ТекСтрокаТЧРасчет.ТН;
		Движение.ИНН = ТекСтрокаТЧРасчет.ИНН;
		Движение.ВсегоПоРасчету = ТекСтрокаТЧРасчет.ВсегоПоРасчету;
		Движение.МинимумПоФакту = ТекСтрокаТЧРасчет.МинимумПоФакту;
		Движение.МаксимумПоФакту = ТекСтрокаТЧРасчет.МаксимумПоФакту;
		Движение.ИтогоДоГраниц = ТекСтрокаТЧРасчет.ИтогоДоГраниц;
		Движение.ОтработаноВсего = ТекСтрокаТЧРасчет.ОтработаноВсего;
		Движение.ИтогоЗаОтработанноеВремя = ТекСтрокаТЧРасчет.Оклад;
		Движение.Оклад0_166_Часы = ТекСтрокаТЧРасчет.ОтработаноВсего;
		Движение.Оклад0_166Сумма = ТекСтрокаТЧРасчет.Оклад;
		Движение.БонусЗаОптику = ТекСтрокаТЧРасчет.ДоплатаЗаОптику+ТекСтрокаТЧРасчет.ДоплатаЗаКабинетВрача;
		Движение.Доплата1 = ТекСтрокаТЧРасчет.Доплата1;
		Движение.Доплата2 = ТекСтрокаТЧРасчет.Доплата2;
		Движение.Статус1 = ТекСтрокаТЧРасчет.Статус1;
		Движение.Статус2 = ТекСтрокаТЧРасчет.Статус2;
		Движение.ПроцентKPI1=ТекСтрокаТЧРасчет.KPIПроцент;
		Движение.ПремияKPI = ТекСтрокаТЧРасчет.KPIСумма;
		Движение.СуммаМД1 = ТекСтрокаТЧРасчет.СуммаМД1;
		Движение.БонусМД1 = ТекСтрокаТЧРасчет.БонусОтМД1;
		Движение.КоличествоАптек=ТекСтрокаТЧРасчет.КоличествоАптек;
		Движение.Уборка=ТекСтрокаТЧРасчет.Уборка;
	КонецЦикла;

	
КонецПроцедуры
